{
  "shared": {
    "contact": {
      "email": "xtnie2019@163.com",
      "phone": "13337258371"
    },
    "projectLinks": {
      "hmall": "https://gitee.com/fr3534houre/hmall",
      "hmdp": "https://gitee.com/fr3534houre/hm-dianping",
      "fer": "https://gitee.com/fr3534houre/mynet",
      "acdamic_search": "https://gitee.com/fr3534houre/acdamic_search"
    }
  },
  "en": {
    "name": "Xuantao Nie",
    "bio": "A graduate student majoring in facial expression recognition; Java development.",
    "education": [
      {
        "period": "2024 - Present",
        "school": "Shanghai University",
        "major": "Computer Science and Technology, Master's Degree",
        "details": "Research focus on Computer Vision and Deep Learning"
      },
      {
        "period": "2019 - 2023",
        "school": "Nanjing Tech University",
        "major": "Bachelor's Degree"
      }
    ],
    "researchAreas": [
      "Deep Learning for Facial Expression Recognition",
      "Early Detection of Mild Cognitive Impairment in the Elderly Using Computer Vision"
    ],
    "recentProjects": [
      {
        "title": "Hmall",
        "description": "An online shopping platform providing features such as product browsing, ordering, and payment. Built on SpringCloud microservices architecture with vertical business splitting into microservices including: user service, product service, order service, shopping cart service, and payment service. Uses Nacos for service governance and RabbitMQ for asynchronous communication.",
        "image": "./src/hmall.png",
        "linkKey": "hmall"
      },
      {
        "title": "CityLife Smart Living Platform",
        "description": "An intelligent lifestyle service platform for urban residents, integrating merchant discovery, community sharing, promotional activities, and social interaction. Features innovative token bucket algorithm for flash sales (300% QPS improvement), multi-level caching with Bloom filters, and social networking functionalities.",
        "image": "./src/hmdp.png",
        "linkKey": "hmdp"
      },
      {
        "title": "Facial Expression Recognition Experiment",
        "description": "Uses the FER2013 and RAF-DB datasets, designs its own models for experiments, covering the model itself, training logs, and test results.",
        "image": "./src/fer_image.png",
        "linkKey": "fer"
      },
      {
        "title": "Academic Research Interaction System",
        "description": "Accurate Literature Retrieval: Implementing efficient literature search using the Elsevier Scopus API; Intelligent Question-Answering System: Utilizing DeepSeek API to implement intelligent question-answering based on literature content; Context Binding: Users can select multiple articles and use their abstracts as context for questions; Conversation Record: Supports saving question-answering history and recording related literature information.",
        "image": "./src/acdamic_research.png",
        "linkKey": "acdamic_search"
      }
    ],
    "campusExperience": [
      {
        "period": "2024 - Present",
        "title": "Innovation and Entrepreneurship Association Officer",
        "description": "Served as an officer in the Student Union's Network Information Department, responsible for maintaining and operating the school's official website and WeChat public account. Provided technical support for school activities, including equipment backend operations, network technology, graphic design, and video post-production."
      },
      {
        "period": "2024 - 2025",
        "title": "Course Teaching Assistant",
        "description": "Assisted in course preparation and student guidance"
      }
    ],
    "papers": [
      {
        "title": "Not available yet (-_-)"
      }
    ],
    "selfEvaluation": "Goal-oriented personality with keen problem insight and efficient problem-solving abilities. Skilled at identifying key issues in complex situations and developing innovative solutions. Emphasizes experience summarization and continuous learning, able to quickly adapt to new environments while maintaining a learning mindset."
  },
  "zh": {
    "name": "Xuantao Nie",
    "bio": "在读研究生，主要研究方向为面部表情识别；Java开发。",
    "education": [
      {
        "period": "2024 - 至今",
        "school": "上海大学",
        "major": "计算机科学与技术，硕士研究生",
        "details": "研究方向：计算机视觉与深度学习"
      },
      {
        "period": "2019 - 2023",
        "school": "南京工业大学",
        "major": "学士学位"
      }
    ],
    "researchAreas": [
      "面部表情识别的深度学习",
      "基于计算机视觉的老年人轻度认知障碍检测"
    ],
    "recentProjects": [
      {
        "title": "HMALL",
        "description": "网上购物平台，提供商品游览、下单、支付等功能，基于SpringCloud微服务架构，业务按照纵向拆分，可以分为以下几个微服务：用户服务、商品服务、订单服务、购物车服务和支付服务，Nacos进行服务治理，RabbitMQ实现服务异步通讯",
        "image": "./src/hmall.png",
        "linkKey": "hmall"
      },
      {
        "title": "CityLife轻生活服务平台",
        "description": "面向城市居民的智能生活服务平台，集成商户发现、社区分享、优惠活动、社交互动等功能。创新性令牌桶算法（QPS提升300%），多层缓存+布隆过滤器（数据库压力降低85%），异步秒杀处理（支持2.5万级并发），Redis ZSet社交互动等技术，构建高性能城市生活服务生态。",
        "image": "./src/hmdp.png",
        "linkKey": "hmdp"
      },
      {
        "title": "深度表情识别实验",
        "description": "使用了FER2013、RAF-DB 等数据集，自己设计模型进行实验，涵盖了模型本体，训练 logs，测试结果等",
        "image": "./src/fer_image.png",
        "linkKey": "fer"
      },
      {
        "title": "智能文献交互系统",
        "description": "精确文献检索：基于Elsevier Scopus API实现高效文献搜索；智能问答系统：利用DeepSeek API实现基于文献内容的智能问答；上下文绑定：用户可以选择多篇文献并将其摘要作为上下文进行问答；会话记录：支持保存问答历史，并记录相关文献信息",
        "image": "./src/acdamic_research.png",
        "linkKey": "acdamic_search"
      }
    ],
    "campusExperience": [
      {
        "period": "2024 - 至今",
        "title": "学院创新创业协会部门干事",
        "description": "在校期间任学生会网络信息部干事,负责学校官方网站、微信公众号的维护和运营。 2. 负责为学校活动进行技术支持,包括设备后台操作、网络技术、平面设计、视频后期制作等"
      },
      {
        "period": "2024 - 2025",
        "title": "课程助教",
        "description": "协助课程准备和学生指导工作"
      }
    ],
    "papers": [
      {
        "title": "A Review of Dynamic Facial Expression Recognition: Methods, Datasets and Directions"
      }
    ],
    "selfEvaluation": "目标导向型人格，具有敏锐的问题洞察力和高效的解决能力。善于从复杂情境中定位关键问题，制定创新解决方案。注重经验总结和持续学习，能够迅速适应新环境并保持学习"
  }
}
