{
  "shared": {
    "contact": {
      "email": "xtnie2019@163.com",
      "phone": "13337258371"
    },
    "projectLinks": {
      "hmall": "https://github.com/fr36/hmall",
      "hmdp": "https://github.com/fr36/hm-dianping",
      "fer": "https://gitee.com/fr3534houre/mynet",
      "acdamic_search": "https://gitee.com/fr3534houre/acdamic_search"
    }
  },
  "en": {
    "name": "Xuantao Nie",
    "bio": "A graduate student majoring in facial expression recognition; Java development.",
    "researchAreas": [
      "Deep Learning for Facial Expression Recognition",
      "Early Detection of Mild Cognitive Impairment in the Elderly Using Computer Vision"
    ],
    "recentProjects": [
      {
        "title": "Hmall E-commerce Platform",
        "description": "An online shopping platform providing features such as product browsing, ordering, and payment. Built on SpringCloud microservices architecture with vertical business splitting into microservices including: user service, product service, order service, shopping cart service, and payment service. Uses Nacos for service governance and RabbitMQ for asynchronous communication.",
        "image": "./src/hmall.png",
        "linkKey": "hmall"
      },
      {
        "title": "Hmdp Review Platform",
        "description": "A front-end and back-end separated project developed with SpringBoot, utilizing Redis, Tomcat, and MySQL to enhance service performance. Similar to Dianping, it implements features such as SMS login, merchant query caching, and coupon flash sales. Notably implements one-person-one-order functionality using distributed locks.",
        "image": "./src/hmdp.png",
        "linkKey": "hmdp"
      },
      {
        "title": "Facial Expression Recognition Experiment",
        "description": "Uses the FER2013 and RAF-DB datasets, designs its own models for experiments, covering the model itself, training logs, and test results.",
        "image": "./src/fer_image.png",
        "linkKey": "fer"
      },
      {
        "title": "Academic Research Interaction System",
        "description": "Accurate Literature Retrieval: Implementing efficient literature search using the Elsevier Scopus API; Intelligent Question-Answering System: Utilizing DeepSeek API to implement intelligent question-answering based on literature content; Context Binding: Users can select multiple articles and use their abstracts as context for questions; Conversation Record: Supports saving question-answering history and recording related literature information.",
        "image": "./src/acdamic_research.png",
        "linkKey": "acdamic_search"
      }
    ],
    "papers": [
      {
        "title": "Not available yet (-_-)"
      }
    ]
  },
  "zh": {
    "name": "Xuantao Nie",
    "bio": "在读研究生，主要研究方向为面部表情识别；Java开发。",
    "researchAreas": [
      "面部表情识别的深度学习",
      "基于计算机视觉的老年人轻度认知障碍检测"
    ],
    "recentProjects": [
      {
        "title": "黑马商城",
        "description": "网上购物平台，提供商品游览、下单、支付等功能，基于SpringCloud微服务架构，业务按照纵向拆分，可以分为以下几个微服务：用户服务、商品服务、订单服务、购物车服务和支付服务，Nacos进行服务治理，RabbitMQ实现服务异步通讯",
        "image": "./src/hmall.png",
        "linkKey": "hmall"
      },
      {
        "title": "黑马点评",
        "description": "一个springboot开发的前后端分离项目，使用了redis、MySQL提高服务性能。类似于大众点评，实现了短信登录、商户查询缓存、优惠卷秒杀等功能。其中重点使用了分布式锁实现了一人一单功能",
        "image": "./src/hmdp.png",
        "linkKey": "hmdp"
      },
      {
        "title": "深度表情识别实验",
        "description": "使用了FER2013、RAF-DB 等数据集，自己设计模型进行实验，涵盖了模型本体，训练 logs，测试结果等",
        "image": "./src/fer_image.png",
        "linkKey": "fer"
      },
      {
        "title": "智能文献交互系统",
        "description": "精确文献检索：基于Elsevier Scopus API实现高效文献搜索；智能问答系统：利用DeepSeek API实现基于文献内容的智能问答；上下文绑定：用户可以选择多篇文献并将其摘要作为上下文进行问答；会话记录：支持保存问答历史，并记录相关文献信息",
        "image": "./src/acdamic_research.png",
        "linkKey": "acdamic_search"
      }

    ],
    "papers": [
      {
        "title": "暂时还没有（-_-)"
      }
    ]
  }
}
